[
    {
        "date": "2022-11-15",
        "description": "11/15/2022 – at around 5:42 p.m. at the driveway of 7 -11 on NE Cornell Road near NE 25th Avenue .  \n This crash involved a vehicle versus a bicyclist with no injuries.  \n Weather was clear and the pavement surface was dry . \n  \n \n The vehicle was stopped northbound in the driveway of the parking lot. Driver looked to her left , \nhowever failed to look right as they were not expecting a bicyclist to be travelling against traffic. \nBicyclist failed to see vehicle stopped in driveway and impacted stopped car.   \n Unknown if citations were issued.\n \n ",
        "in_intersection": "no",
        "latitude": 45.53096,
        "longitude": -122.957473,
        "severity": "no injury",
        "source": "20230124_clean.txt",
        "street0": "NE Cornell Road",
        "street1": "NE 25th Ave",
        "time": "17:42"
    },
    {
        "date": "2022-11-27",
        "description": "11/27/2022 – at around 5:06 p.m. 300 ft west of the intersection of S E 40\nth Avenue and SE TV Hwy  \n This crash involved a TriMet bus versus pedestrian. Pedestrian was transported but reported only minor injuries.  \n Weather was rainy and the pavement was wet.  \n The bus was traveling west on SE TV Hwy at speed limit when a pedestrian and pet was witnessed to \nbe walking in the lane of traffic and attempting to cross from north to south. Bus was unable to stop in \ntime to avoid impact.  \n \nUnknown if citations were issued.\n\n ",
        "in_intersection": "no",
        "latitude": 45.501647,
        "longitude": -122.942513,
        "severity": "minor injury",
        "source": "20230124_clean.txt",
        "street0": "SE 40th Avenue",
        "street1": "SE TV Hwy",
        "time": "17:06"
    },
    {
        "date": "2022-12-09",
        "description": "12/9/2022 – at around 10:11 p.m. 150 ft north of the intersection of NW 185th and NE Evergreen Pkwy  \n This crash was a vehicle versus pedestrian crash where no to minor injuries were reported.  \n Weather unknown  \n A pedestrian was observed running southbound on NW 185th between stopped southbound vehicles. \nPedestrian failed to look for northbound traffic when running across northbound lanes and was struck \nby a northbound vehicle. Northbound vehicle was travelling northbound when a pedestrian appeare d \nfrom between stopped vehicles and they were unable to stop and avoid impact.  \n \nCitation was not issued\n\n",
        "in_intersection": "no",
        "latitude": 45.538602,
        "longitude": -122.867432,
        "severity": "minor injury",
        "source": "20230124_clean.txt",
        "street0": "NW 185th Ave",
        "street1": "NE Evergreen Pkwy",
        "time": "22:11"
    },
    {
        "date": "2022-12-14",
        "description": "12/14/2022 – at around 9:54 a.m. at the intersection of SE 10th Avenue and SE Maple Street  \n \nThis crash involved a vehicle versus pedestrian. Pedestrian reported minor injuries.  \n \nWeather was clear and dry.  \n \nPedestrian was travelling west to east across SE 10th. Pedestrian stated they began to cross at the \ncrosswalk when they received the walk signal. Pedestrian was hit from behind by  a right turning \nvehicle. Vehicle did not stop and was not found.  \n \n  ",
        "in_intersection": "yes",
        "latitude": 45.514926,
        "longitude": -122.974013,
        "severity": "minor injury",
        "source": "20230124_clean.txt",
        "street0": "SE 10th Avenue",
        "street1": "SE Maple Street",
        "time": "09:54"
    },
    {
        "date": "2022-12-16",
        "description": "12/16/2022 – at around 3:45 p.m. at the intersection of SE Century Blvd and SE Johnson Street  \n \nThis crash involved a vehicle versus pedestrian. Pedestrian reported minor injuries.  \n Weath er unknown.  \n Pedestrian was travelling north to south across SE Johnson at an unmarked crosswalk. Pedestrian was sideswiped by a vehicle turning left from SE Century onto SE Johnson. Vehicle did not stop and was not found.\n \n",
        "in_intersection": "yes",
        "latitude": 45.5007,
        "longitude": -122.916985,
        "severity": "minor injury",
        "source": "20230124_clean.txt",
        "street0": "SE Century Blvd",
        "street1": "SE Johnson Street",
        "time": "15:45"
    },
    {
        "date": "2022-12-17",
        "description": "12/17/2022 – at around 4:01 p.m. north of the intersection of NE Cornelius Pass and NE Shaleen Street   \n This crash involved a vehicle versus pedestrian where serious injuries were reported.  \n Weather was clear and the pavement was dry.  \n Witness stated that pedestrian was walking southbound on east side of Cornelius Pass Road, pedestrian was then observed to walk into road to cross and was s ideswiped by northbound driver.  \n Driver stated that they did not see what they hit, only heard a thump –  looked back in rearview mirror \nand realiz ed they had hit a pedestrian. Driver was driving speed limit of 45  mph.  \n No citation s were issued  \n \n",
        "in_intersection": "no",
        "latitude": 45.517,
        "longitude": -122.899941,
        "severity": "serious injury",
        "source": "20230124_clean.txt",
        "street0": "NE Cornelius Pass Rd",
        "street1": "NE Shaleen St",
        "time": "16:01"
    },
    {
        "date": "2022-12-18",
        "description": "12/18/2022 – at around 3:09 p.m. at the intersection of NE Cornell Road and NE Butler Street  \n This crash involved a vehicle versus bicyclist where no to minor injuries were reported.  \n Weather was cloudy and the pavement was dry.  \n Bicyclist state d that the y were travelling eastbound on Cornell approaching Butler. She proceeded \nthrough the green light and was struck\n \n Driver stated that they were travelling eastbound on Cornell also approaching Butler. They were going \nto Winco  and couldn’t recall exactly where they were supposed to turn, they suddenly turned onto \nButler  and impacted the bicyclist. They did not see bicyclist  but felt the impact . \n Driver was cited for failing to obey traffic control device\n \n ",
        "in_intersection": "yes",
        "latitude": 45.53778,
        "longitude": -122.905277,
        "severity": "minor injury",
        "source": "20230124_clean.txt",
        "street0": "NE Cornell Road",
        "street1": "NE Butler Street",
        "time": "15:09"
    },
    {
        "date": "2022-12-19",
        "description": "12/19/2022 – at around 3:07 p.m. at the intersection of SE 10th Avenue and SE Oak Street  \n This crash involved a vehicle versus bicyclist where minor injuries were reported.  \n \nWeather was cloudy and the pavement was wet.   \n\n Bicyclist state d that they  were northbound on a green light in the crosswalk on SE 10th Avenue when \nthey were struck by an eastbound vehicle.  \n \nDriver state d that they had stopped at the red light and was not in  the crosswalk when they impacted \nthe bicyclist . \n There were no independent witnesses to confirm what occurred.\n \n  ",
        "in_intersection": "yes",
        "latitude": 45.518782,
        "longitude": -122.973943,
        "severity": "minor injury",
        "source": "20230124_clean.txt",
        "street0": "SE 10th Avenue",
        "street1": "SE Oak Street",
        "time": "15:07"
    },
    {
        "date": "2023-01-02",
        "description": "1/2/2023 – at around 3:09 p.m. at the intersection of SE 9th Avenue and SE Washington Street  \n \nThis crash involved a vehicle versus a 3 wheeled mobility device “scooter” where no injuries were \nreported.  \n \nWeather was cloudy and the pavement was dry.  \n \nDriver was travelling eastbound on SE Washington on a green light when the scooter operator  crossed \ninto the roadway.  \n \nThe scooter operator was travelling northbound across SE Washington outside the crosswalk against a red light.  \n It should be noted that the scooter operator was observed by the officer failing to obey a traffic control \ndevice again directly after this incident.  \n The scooter operator was cited for failing to obey a traffic control device.  \n ",
        "in_intersection": "yes",
        "latitude": 45.521353,
        "longitude": -122.97551,
        "severity": "no injury",
        "source": "20230124_clean.txt",
        "street0": "SE 9th Avenue",
        "street1": "SE Washington Street",
        "time": "15:09"
    },
    {
        "date": "2023-01-02",
        "description": "1/2/2023 – at around 4:40 p.m. at the intersection of SW 17th Avenue and SW Baseline Road  \n This crash involved a vehicle versus vehicle where a passenger was transported, however injuries were suspected to be minor . \n Weather was cloudy and the pavement was dry.  \n \nDriver 1 was travelling westbound on SW Baseline Road when they turned left on a flashing yellow light \nto travel south on SE 17th Avenue where they were struck by an eastbound vehicle.  \n \nDriver 2 was travelling eastbound through a green light on SW Baseline Road when a westbound \nvehicle turned in front of them. Driver 2 was unable to stop in time to avoid impact.  \n \nNo citations were issued.  \n \n",
        "in_intersection": "yes",
        "latitude": 45.52006,
        "longitude": -122.978943,
        "severity": "minor injury",
        "source": "20230124_clean.txt",
        "street0": "SW 17th Avenue",
        "street1": "SW Baseline Road",
        "time": "16:40"
    },
    {
        "date": "2023-01-15",
        "description": "1/15/2023 – at around 6:40 p.m. near the intersection of W Baseline Road and SW 215th Avenue (this \nintersection is just outside Hillsboro City Limits)  \n  \n This crash involved a vehicle versus pedestrian where there were no reported injuries . \n \nWeather was clear and the pavement was wet.  \n Driver 1 was travelling eastbound on W Baseline when the pedestrian appeared in front of them. They were unable to stop in time to avoid impact.   Independent witness provided same crash details, both pedestrians were observed crossing W Baseline outside a crosswalk with dark clo thing . \n Both the pedestrian that was struck and friend were intoxicated and refused to provide as statement \nor details to the crash.  \n No citations were issued.  \n \n",
        "in_intersection": "no",
        "latitude": 45.515249,
        "longitude": -122.897651,
        "severity": "no injury",
        "source": "20230124_clean.txt",
        "street0": "W Baseline Road",
        "street1": "SW 215th Avenue",
        "time": "18:40"
    }
]
